.org/babel.org
#+PROPERTY: header-args:emacs-lisp :tangle ~/dotfiles/dotfiles/.emacs.d/init.el :mkdirp yes
#+Title Emacs!

Apply the same configuration above to every block
Tangle means where to put this files code to
mkdirp create directory if needed

Sometimes have to type org-mode so that it reloades

* Mac-OS
Install with:
#+begin_src shell
brew tap d12frosted/emacs-plus
brew install emacs-plus
#+end_src

And remember to symlink, check how with
#+begin_src shell
brew info emacs-plus
#+end_src
* Prefixes
 - C-x: emacs keybindings
 - C-h: help
 - M-x: execute function
 - C-c: user-defined keybindings
 - C-SPC: more user defined keybindings

* Guide to keybindings
- C-n C-p : in normal mode to go back and forth the clipboard
- C-x o : emacs go between windows
- C-h v : help on variables
- C-h f : help on functions

* General information
Use bookmarks to open specific files.
To get help on variable of function put corsor over it and press C-h v or C-h f

* Undo in Emacs

C-r WONT WORK, cause we are not using a redo we have a undo stack
undo is treated like a normal command, therefore you can undo the undo.
undo's will go to the stack, if a move like "k" is done then you can undo again, this makes it possible to undo every single edit.
in typicall (global-undo-tree-mode) (evil-set-undo-system 'undo-tree)
if you are doing several undos and miss the "correct spot" and do anything at all which is not an undo command, you are stuck: you broke the chain of undos https://www.emacswiki.org/emacs/RedoMode

* Solving errors
If package give error try:type list-packages command to update packages

* Code
** Customize System to different file
#+begin_src emacs-lisp
(setq custom-file "~/.emacs.d/custom.el")
(load custom-file)
#+end_src
** Basic UI Settings

#+begin_src emacs-lisp
  ;; You will most likely need to adjust this font size for your system!
  (defvar runemacs/default-font-size 110)

  (setq inhibit-startup-message t) ; Disable startup menu
  (scroll-bar-mode -1) ; Disable the scrollbar
  (tool-bar-mode -1)
  ;(tooltip-mode -1) disable tooltips ;; (text displayed when hovering over an element)
  (set-fringe-mode 10) ; Make some space
  (menu-bar-mode -1) ;; remove top bar
  (cond ((eq system-type 'windows-nt)
      ;; Windows-specific code goes here.
      )
        ((eq system-type 'darwin)
      )
      ((eq system-type 'gnu/linux)
       (setq visible-bell t)
      ))

  (setq scroll-step            1
      scroll-conservatively  10000) ;; scroll line by line not like a fucking degenerate
  (setq smooth-scroll-margin 4) ;; margin like in vim

  (setq vc-follow-symlinks t) ;; always follow symlinks
  (column-number-mode)
  (global-display-line-numbers-mode t) ;; display line numbers everywhere
  ;; (setq vc-follow-symlinks nil) ;; or never follow them
#+end_src

** Font settings 
#+begin_src emacs-lisp
    ;; Font Configuration -----------------------
    ;; (set-face-attribute 'default nil :font "SauceCodePro Nerd Font 11")
    ;; IF FONT LOOKS WEIRD (TOO SLIM) then it means the font is not working properly, CHANGE IT

  (cond ((eq system-type 'windows-nt)
      ;; Windows-specific code goes here.
      )
        ((eq system-type 'darwin)
        (set-face-attribute 'default nil :font "FiraCode Nerd Font" :height 180)

        ;; Set the fixed pitch face
        (set-face-attribute 'fixed-pitch nil :font "FiraCode Nerd Font" :height 200)

        ;; Set the variable pitch face
        (set-face-attribute 'variable-pitch nil :font "Cantarell" :height 200 :weight 'regular)
      )
      ((eq system-type 'gnu/linux)
        (set-face-attribute 'default nil :font "FuraCode Nerd Font" :height runemacs/default-font-size)

        ;; Set the fixed pitch face
        (set-face-attribute 'fixed-pitch nil :font "FuraCode Nerd Font" :height 120)

        ;; Set the variable pitch face
        (set-face-attribute 'variable-pitch nil :font "DejaVu Sans" :height 120 :weight 'regular)
      ))
    ;; -------------------------------------------------------
#+end_src

** Spell-checking

#+begin_src emacs-lisp
  ;; execute spanish spell-checking on buffer
  (defun flyspell-spanish ()
    (interactive)
    (ispell-change-dictionary "castellano")
    (flyspell-buffer))

  (defun flyspell-english ()
    (interactive)
    (ispell-change-dictionary "default")
    (flyspell-buffer))
#+end_src

** Packages

#+begin_src emacs-lisp

  ;; Initialize package sources
  (require 'package) ; bring in package module
  ; package repositories
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize) ; Initializes package system
  (unless package-archive-contents ; unless package exists we refresh package list
   (package-refresh-contents)) 

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package) ; is this package installed, unless its installed install it
     (package-install 'use-package))
  (require 'use-package)

  (setq use-package-always-ensure t) ;; equivalent to writing :ensure t in all packages
  ;; makes sure that package is downloaded before use
#+end_src

** General configurations

#+begin_src emacs-lisp
  
  (setq x-select-enable-clipboard-manager nil); weird emacs bug where it won't close
  ;(use-package command-log-mode)

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  (global-auto-revert-mode) ;;

#+end_src

*** Disable line numbers
#+begin_src emacs-lisp
  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  eshell-mode-hook
                  shell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0 ))))
#+end_src
** Unused packages

#+begin_src emacs-lisp
;; (use-package langtool)

;; has to install pdf2svg on pc first
;; (use-package org-inline-pdf
;;   :init
;;   (add-hook 'org-mode-hook #'org-inline-pdf-mode))
#+end_src

** UI settings
*** Ivy
#+begin_src emacs-lisp
(use-package ivy ; makes navigation between stuff easier
:diminish ; do not show stuff on bar or something
:bind (("C-s" . swiper) ;;like / but with context
        :map ivy-minibuffer-map
        ("TAB" . ivy-alt-done)	
        ("C-l" . ivy-alt-done)
        ("C-j" . ivy-next-line)
        ("C-k" . ivy-previous-line)
        :map ivy-switch-buffer-map
        ("C-k" . ivy-previous-line)
        ("C-l" . ivy-done)
        ("C-d" . ivy-switch-buffer-kill)
        :map ivy-reverse-i-search-map
        ("C-k" . ivy-previous-line)
        ("C-d" . ivy-reverse-i-search-kill))
:config
(ivy-mode 1))

;; eval last sexp is better cause inconsistencies from hooks when running evalbuffer
;; and show keybindings
(use-package ivy-rich
:init
(ivy-rich-mode 1))
#+end_src

*** Counsel 
#+begin_src emacs-lisp

;; With ivy-rich shows descriptions for commands 
(use-package counsel
:bind (("M-x" . counsel-M-x)
        ("C-x b" . counsel-ibuffer)
        ("C-x C-f" . counsel-find-file)
        :map minibuffer-local-map
        ("C-r" . 'counsel-minibuffer-history))
        :config
        (setq ivy-initial-inputs-alist nil))


#+end_src

*** Doom 
#+begin_src emacs-lisp
  (use-package all-the-icons)
  ;; custom command line
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))
  (use-package doom-themes) ;; counsel-load-theme to load a theme from the list
  (load-theme 'doom-one t) ;; if not using t will prompt if its safe to https://github.com/Malabarba/smart-mode-line/issues/100
#+end_src
