.org/babel.org
** Keybindings

#+begin_src emacs-lisp
  (global-set-key (kbd "C-M-j") 'counsel-switch-buffer) ;; easier command to switch buffers
    ;; example (define-key emacs-lisp-mode-map (kbd "C-x M-t") 'counsel-load-theme) define keybinding only in emacs-lisp-mode

  (use-package general ;; set personal bindings for leader key for example
   ; (general-define-key "C-M-j" 'counsel-switch-buffer) ;; allows to define multiple global keybindings
    :config
    (general-create-definer rune/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC" 
    :global-prefix "C-SPC") ;; leader
    (rune/leader-keys ;; try to have similar keybindings in vim as well
     "t" '(:ignore t :which-key "toggles") ;; "folder" for toggles
     "b" '(:ignore b :which-key "buffers") 
     "h" '(:ignore h :which-key "git-gutter") 
     "c" '(org-capture :which-key "org-capture") ;; this is F*** awesome
     "g" '(git-gutter-mode :which-key "git-gutter toggle") 
     "hn" '(git-gutter:next-hunk :which-key "next hunk") 
     "hp" '(git-gutter:previous-hunk :which-key "previous hunk") 
     "hv" '(git-gutter:popup-hunk :which-key "preview hunk") 
     "hs" '(git-gutter:stage-hunk :which-key "stage hunk") 
     "hu" '(git-gutter:revert-hunk :which-key "undo hunk") ;; take back changes
     "hg" '(git-gutter :which-key "update changes") 
     "o" '(buffer-menu :which-key "buffer menu") 
     "bn" '(evil-next-buffer :which-key "next buffer") 
     "bp" '(evil-prev-buffer :which-key "previous buffer")
     "bc" '(evil-delete-buffer :which-key "close buffer")
     "bd" '(delete-file-and-buffer :which-key "delete file")
     "w" '(save-buffer :which-key "save buffer") ;; classic vim save
     "tt" '(counsel-load-theme :which-key "choose theme")))
#+end_src

*** Hydra
#+begin_src emacs-lisp
  (use-package hydra) ;; emacs bindings that stick around like mode for i3

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

  (rune/leader-keys
    "ts" '(hydra-text-scale/body :which-key "scale text"))

#+end_src
*** Evil
#+begin_src emacs-lisp
  ;; vim keybindings for easier on the fingers typing :D
  (use-package evil
    :init
    (setq evil-want-integration t) ;; must have
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    ;(define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line) ;; both of these
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line) ;; are needed for org mode where g-j doesn't work properly

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))
  ;; to center screen on cursor, zz or emacs-style C-l

  ;; https://github.com/linktohack/evil-commentary
  ;; use-package makes it so that it installs it from config and config section
  ;; activates the mode
  (use-package evil-commentary
    :config
    (evil-commentary-mode))

  (use-package evil-collection
    :after evil ;; load after evil, must have
    :config
    (evil-collection-init))

  ; C-z go back to EMACS MODE

#+end_src

** Programming
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode)) ;; prog-mode is based mode for any programming language
#+end_src

** Help

#+begin_src emacs-lisp

  (use-package which-key ;; This shows which commands are available for current keypresses
    :init (which-key-mode) ;; runs before package is loaded automatically whether package is loaded or not we can also invoke the mode
    :diminish which-key-mode
    :config ;; this is run after the package is loaded
    (setq which-key-idle-delay 0.15)) ;; delay on keybindings 

  (use-package helpful ;; better function descriptions
    :custom ;; custom variables
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function) ;; remap keybinding to something different
    ([remap describe-command] . helpful-command) 
    ([remap describe-variable] . counsel-describe-variable))

#+end_src

** Functions
#+begin_src emacs-lisp
  (defun delete-file-and-buffer ()
    "Kill the current buffer and deletes the file it is visiting."
    (interactive)
    (let ((filename (buffer-file-name)))
      (if filename
          (if (y-or-n-p (concat "Do you really want to delete file " filename " ?"))
              (progn
                (delete-file filename)
                (message "Deleted file %s." filename)
                (kill-buffer)))
        (message "Not a file visiting buffer!"))))

#+end_src

** Git

*** Magit
#+begin_src emacs-lisp
  ;; bring in the GIT
  ;; use C-x g to open magit status
  ;; type ? to know what can you do with magit
  (use-package magit ;; use tab to open instead of za in vim
    ;; :custom
    ;;   (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    )

#+end_src

*** Projects
#+begin_src emacs-lisp
  ;; emacs variables local to projects
  (use-package projectile ;; git projects management
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy)) ;; use ivy for completion can also use helm
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/")
      (setq projectile-project-search-path '("~/")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile ;; more commands with M-o in projectile (ivy allows that)
    :config(counsel-projectile-mode)) 
#+end_src
*** Gutter

#+begin_src emacs-lisp
  (use-package git-gutter ;; works just like in vim :D
    :config
    ;; If you enable global minor mode
    (global-git-gutter-mode t)
    ;; If you enable git-gutter-mode for some modes
    (add-hook 'ruby-mode-hook 'git-gutter-mode)
    )
#+end_src

*** Unused packages

#+begin_src emacs-lisp
  ;; (use-package diff-hl
  ;;   :init
  ;;   (add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh)
  ;;   (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
  ;;   :config
  ;;   (global-diff-hl-mode)
  ;;   (diff-hl-margin-mode)
  ;;   )
  ;; NOTE: Make sure to configure a GitHub token before using this package!
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
  ;; (use-package forge) ;; more git functionality


#+end_src

